N = int(input('Введіть ширину трикутника від 1 до 4: '))
while not 1 <= N <= 4:
    print('Не вірна ширина трикутника')
    N = int(input('Введіть ширину трикутника від 1 до 4: '))

for i in range(5, -1, -1):
    if N == 1:
        print((i + 1) * "*")
N = int(input('Введіть ширину трикутника від 1 до 4: '))
for i in range(5):
    if N == 2:
        print((i + 1) * "*")
N = int(input('Введіть ширину трикутника від 1 до 4: '))
for i in range(4, -1, -1):
    if N == 3:
        print(f'{(i + 1) * "*" : >5}')
N = int(input('Введіть ширину трикутника від 1 до 4: '))
for i in range(5):
    if N == 4:
        print(f'{(i + 1) * "*" : >5}')
N = int(input('Введіть ширину трикутника від 1 до 4: '))
